Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
col_t_0_xf (InputLayer)         [(None, 1)]          0
__________________________________________________________________________________________________
col_t_1_xf (InputLayer)         [(None, 1)]          0
__________________________________________________________________________________________________
col_t_2_xf (InputLayer)         [(None, 1)]          0
__________________________________________________________________________________________________
col_t_3_xf (InputLayer)         [(None, 1)]          0
__________________________________________________________________________________________________
col_t_4_xf (InputLayer)         [(None, 1)]          0
__________________________________________________________________________________________________
col_t_5_xf (InputLayer)         [(None, 1)]          0
__________________________________________________________________________________________________
col_t_6_xf (InputLayer)         [(None, 1)]          0
__________________________________________________________________________________________________
col_t_7_xf (InputLayer)         [(None, 1)]          0
__________________________________________________________________________________________________
col_t_8_xf (InputLayer)         [(None, 1)]          0
__________________________________________________________________________________________________
col_t_9_xf (InputLayer)         [(None, 1)]          0
__________________________________________________________________________________________________
col_t_10_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_11_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_12_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_13_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_14_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_15_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_16_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_17_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_18_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_19_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_20_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_21_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_22_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_23_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_24_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_25_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_26_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_27_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_28_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_29_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_30_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_31_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_32_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_33_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_34_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_35_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_36_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_37_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_38_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_39_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_40_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_41_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_42_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_43_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_44_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_45_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_46_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_47_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_48_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_49_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_50_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_51_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_52_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_53_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_54_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_55_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_56_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_57_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_58_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_59_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_60_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_61_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_62_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_63_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_64_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_65_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_66_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_67_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_68_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_69_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_70_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_71_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_72_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_73_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_74_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_75_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_76_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_77_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_78_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_79_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_80_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_81_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_82_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_83_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_84_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_85_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_86_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_87_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_88_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_89_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_90_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_91_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_92_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_93_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_94_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_95_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_96_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_97_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_98_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
col_t_99_xf (InputLayer)        [(None, 1)]          0
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 100)          0           col_t_0_xf[0][0]
                                                                 col_t_1_xf[0][0]
                                                                 col_t_2_xf[0][0]
                                                                 col_t_3_xf[0][0]
                                                                 col_t_4_xf[0][0]
                                                                 col_t_5_xf[0][0]
                                                                 col_t_6_xf[0][0]
                                                                 col_t_7_xf[0][0]
                                                                 col_t_8_xf[0][0]
                                                                 col_t_9_xf[0][0]
                                                                 col_t_10_xf[0][0]
                                                                 col_t_11_xf[0][0]
                                                                 col_t_12_xf[0][0]
                                                                 col_t_13_xf[0][0]
                                                                 col_t_14_xf[0][0]
                                                                 col_t_15_xf[0][0]
                                                                 col_t_16_xf[0][0]
                                                                 col_t_17_xf[0][0]
                                                                 col_t_18_xf[0][0]
                                                                 col_t_19_xf[0][0]
                                                                 col_t_20_xf[0][0]
                                                                 col_t_21_xf[0][0]
                                                                 col_t_22_xf[0][0]
                                                                 col_t_23_xf[0][0]
                                                                 col_t_24_xf[0][0]
                                                                 col_t_25_xf[0][0]
                                                                 col_t_26_xf[0][0]
                                                                 col_t_27_xf[0][0]
                                                                 col_t_28_xf[0][0]
                                                                 col_t_29_xf[0][0]
                                                                 col_t_30_xf[0][0]
                                                                 col_t_31_xf[0][0]
                                                                 col_t_32_xf[0][0]
                                                                 col_t_33_xf[0][0]
                                                                 col_t_34_xf[0][0]
                                                                 col_t_35_xf[0][0]
                                                                 col_t_36_xf[0][0]
                                                                 col_t_37_xf[0][0]
                                                                 col_t_38_xf[0][0]
                                                                 col_t_39_xf[0][0]
                                                                 col_t_40_xf[0][0]
                                                                 col_t_41_xf[0][0]
                                                                 col_t_42_xf[0][0]
                                                                 col_t_43_xf[0][0]
                                                                 col_t_44_xf[0][0]
                                                                 col_t_45_xf[0][0]
                                                                 col_t_46_xf[0][0]
                                                                 col_t_47_xf[0][0]
                                                                 col_t_48_xf[0][0]
                                                                 col_t_49_xf[0][0]
                                                                 col_t_50_xf[0][0]
                                                                 col_t_51_xf[0][0]
                                                                 col_t_52_xf[0][0]
                                                                 col_t_53_xf[0][0]
                                                                 col_t_54_xf[0][0]
                                                                 col_t_55_xf[0][0]
                                                                 col_t_56_xf[0][0]
                                                                 col_t_57_xf[0][0]
                                                                 col_t_58_xf[0][0]
                                                                 col_t_59_xf[0][0]
                                                                 col_t_60_xf[0][0]
                                                                 col_t_61_xf[0][0]
                                                                 col_t_62_xf[0][0]
                                                                 col_t_63_xf[0][0]
                                                                 col_t_64_xf[0][0]
                                                                 col_t_65_xf[0][0]
                                                                 col_t_66_xf[0][0]
                                                                 col_t_67_xf[0][0]
                                                                 col_t_68_xf[0][0]
                                                                 col_t_69_xf[0][0]
                                                                 col_t_70_xf[0][0]
                                                                 col_t_71_xf[0][0]
                                                                 col_t_72_xf[0][0]
                                                                 col_t_73_xf[0][0]
                                                                 col_t_74_xf[0][0]
                                                                 col_t_75_xf[0][0]
                                                                 col_t_76_xf[0][0]
                                                                 col_t_77_xf[0][0]
                                                                 col_t_78_xf[0][0]
                                                                 col_t_79_xf[0][0]
                                                                 col_t_80_xf[0][0]
                                                                 col_t_81_xf[0][0]
                                                                 col_t_82_xf[0][0]
                                                                 col_t_83_xf[0][0]
                                                                 col_t_84_xf[0][0]
                                                                 col_t_85_xf[0][0]
                                                                 col_t_86_xf[0][0]
                                                                 col_t_87_xf[0][0]
                                                                 col_t_88_xf[0][0]
                                                                 col_t_89_xf[0][0]
                                                                 col_t_90_xf[0][0]
                                                                 col_t_91_xf[0][0]
                                                                 col_t_92_xf[0][0]
                                                                 col_t_93_xf[0][0]
                                                                 col_t_94_xf[0][0]
                                                                 col_t_95_xf[0][0]
                                                                 col_t_96_xf[0][0]
                                                                 col_t_97_xf[0][0]
                                                                 col_t_98_xf[0][0]
                                                                 col_t_99_xf[0][0]
__________________________________________________________________________________________________
dense (Dense)                   (None, 25)           2525        concatenate[0][0]
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 25)           650         dense[0][0]
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 25)           650         dense_1[0][0]
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 25)           650         dense_2[0][0]
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 25)           650         dense_3[0][0]
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 3)            78          dense_4[0][0]
==================================================================================================
Total params: 5,203
Trainable params: 5,203
Non-trainable params: 0
__________________________________________________________________________________________________
